In [24]:
import scipy.stats as stats
from math import sqrt
import numpy as np
from scipy import stats
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd

EXERCISE 1. What is the normal body temperature for healthy humans? A random sample of 130 healthy human body temperatures provided by Allen Shoemaker yielded 98.25 degrees and standard deviation 0.73 degrees. 
Give a 99% confidence interval for the average body temperature of healthy people.

In [7]:
x_bar = 98.25 # sample mean
n = 130 # number of samples
sigma = 0.73 # sd of population
mu = 10 # Population mean

In [10]:
sem = sigma / np.sqrt(n)

In [11]:
sem

0.06402523540941313

In [12]:
moe = 2.57 * sem
moe

0.16454485500219174

In [13]:
upper_lim = x_bar + moe
upper_lim

98.41454485500219

In [14]:
low_lim = x_bar - moe
low_lim

98.08545514499781

EXERCISE 2. The administrators for a hospital wished to estimate the average number of days required for inpatient treatment of patients between the ages of 25 and 34. A random sample of 500 hospital patients between these ages produced a mean and standard deviation equal to 5.4 and 3.1 days, respectively.
Construct a 95% confidence interval for the mean length of stay for the population of patients from which the sample was drawn.

In [15]:
x_bar = 5.4 # sample mean
n = 500 # number of samples
sigma = 3.1 # sd of population
mu = 10 # Population mean

In [16]:
sem = sigma / np.sqrt(n)
sem

0.13863621460498696

In [17]:
moe = 1.96 * sem
moe

0.27172698062577444

In [18]:
upper_lim = x_bar + moe
upper_lim

5.671726980625775

In [19]:
low_lim = x_bar - moe
low_lim

5.128273019374226

EXERCISE 3. The hourly wages in a particular industry are normally distributed with mean $13.20 and standard deviation $2.50. A company in this industry employs 40 workers, paying them an average of $12.20 per hour. Can this company be accused of paying substandard wages? Use an α = .01 level test.

In [20]:
# Ho: mu = 13.2
# Ha: mu < 13.2
mu = 13.2
sample_size = 40
sample_std = 2.5
sample_mean = 13.2
x_bar = 12.20

In [21]:
z = (x_bar - mu)/(sample_std/sqrt(sample_size))
z

-2.5298221281347035

In [ ]:
Zo.o1 = -2.325
Z< Zo.o1
We reject the null hypothesis at 1% level test.

EXERCISE 5. The following dataset is based on data provided by the World Bank (https://datacatalog.worldbank.org/dataset/education-statistics). World Bank Edstats.  2015 PISA Test Dataset
1.	Get descriptive statistics (the central tendency, dispersion and shape of a dataset’s distribution) for each continent group (AS, EU, AF, NA, SA, OC).
2.	Determine whether there is any difference (on the average) for the math scores among European (EU) and Asian (AS) countries (assume normality and equal variances). Draw side-by-side box plots.

In [29]:
df = pd.read_csv(r"C:\Users\Atina\Downloads\2015_PISA_Test.csv")

In [30]:
df

,Country Code,Continent_Code,internet_users_per_100,Math,Reading,Science
0,ALB,EU,63.252933,413.1570,405.2588,427.2250
1,ARE,AS,90.500000,427.4827,433.5423,436.7311
2,ARG,SA,68.043064,409.0333,425.3031,432.2262
3,AUS,OC,84.560519,493.8962,502.9006,509.9939
4,AUT,EU,83.940142,496.7423,484.8656,495.0375
...,...,...,...,...,...,...
65,TUN,AF,48.519836,366.8180,361.0555,386.4034
66,TUR,EU,53.744979,420.4540,428.3351,425.4895
67,URY,SA,64.600000,417.9919,436.5721,435.3630
68,USA,NaN,74.554202,469.6285,496.9351,496.2424
69,VNM,AS,43.500000,494.5183,486.7738,524.6445

In [31]:
df.head()

,Country Code,Continent_Code,internet_users_per_100,Math,Reading,Science
0,ALB,EU,63.252933,413.1570,405.2588,427.2250
1,ARE,AS,90.500000,427.4827,433.5423,436.7311
2,ARG,SA,68.043064,409.0333,425.3031,432.2262
3,AUS,OC,84.560519,493.8962,502.9006,509.9939
4,AUT,EU,83.940142,496.7423,484.8656,495.0375

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Country Code            70 non-null     object
 1   Continent_Code          65 non-null     object
 2   internet_users_per_100  70 non-null     float64
 3   Math                    70 non-null     float64
 4   Reading                 70 non-null     float64
 5   Science                 70 non-null     float64
dtypes: float64(4), object(2)
memory usage: 3.4+ KB

In [33]:
df.describe()

       internet_users_per_100        Math     Reading     Science
count               70.000000   70.000000   70.000000   70.000000
mean                71.973099  460.971557  460.997291  465.439093
std                 16.390632   53.327205   49.502679   48.397254
min                 21.976068  327.702000  346.549000  331.638800
25%                 60.899020  417.416075  426.948625  425.923375
50%                 72.999350  477.607150  480.199850  475.400050
75%                 85.026763  500.482925  499.687475  502.431250
max                 98.200000  564.189700  535.100200  555.574700